
## Plan Result (sandbox)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 3 to destroy.</code></pre>

* Delete
  * module.plum-redis-storage.azurerm_storage_account.backup[0]
* Replace
  * module.plum-redis-storage.azurerm_private_endpoint.this[0]
  * module.plum-redis-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.plum-redis-storage.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/privateEndpoints/crumble-recipe-backend-session-storage-sandbox" -> (known after apply)
        name                          = "crumble-recipe-backend-session-storage-sandbox"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/networkInterfaces/crumble-recipe-backend-session-storage-sand.nic.e8567369-1005-47bd-8653-6a20a625c8d6"
              - name = "crumble-recipe-backend-session-storage-sand.nic.e8567369-1005-47bd-8653-6a20a625c8d6"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/privateEndpoints/crumble-recipe-backend-session-storage-sandbox/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "crumble-recipe-backend-session-storage-sandbox.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.100.136.5",
                        ]
                      - name         = "crumble-recipe-backend-session-storage-sandbox"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "2024-06-22"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/privateEndpoints/crumble-recipe-backend-session-storage-sandbox/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "crumble-recipe-backend-session-storage-sandbox"
          ~ private_connection_resource_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Cache/redis/crumble-recipe-backend-session-storage-sandbox" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.100.136.5" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.plum-redis-storage.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ family                        = "P" -> "C"
      ~ hostname                      = "crumble-recipe-backend-session-storage-sandbox.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Cache/redis/crumble-recipe-backend-session-storage-sandbox" -> (known after apply)
        name                          = "crumble-recipe-backend-session-storage-sandbox"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ sku_name                      = "Premium" -> "Basic" # forces replacement
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "2024-06-22"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          ~ maxclients                              = 7500 -> (known after apply)
          ~ rdb_backup_enabled                      = true -> false
          - rdb_backup_frequency                    = 360 -> null
          - rdb_backup_max_snapshot_count           = 1 -> null
          - rdb_storage_connection_string           = (sensitive value) -> null
            # (10 unchanged attributes hidden)
        }
    }

  # module.plum-redis-storage.azurerm_storage_account.backup[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_storage_account" "backup" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "GRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = true -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - dns_endpoint_type                 = "Standard" -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Storage/storageAccounts/crumblesandboxredissa" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - local_user_enabled                = true -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "crumblesandboxredissa" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://crumblesandboxredissa.blob.core.windows.net/" -> null
      - primary_blob_host                 = "crumblesandboxredissa.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://crumblesandboxredissa.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "crumblesandboxredissa.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://crumblesandboxredissa.file.core.windows.net/" -> null
      - primary_file_host                 = "crumblesandboxredissa.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://crumblesandboxredissa.queue.core.windows.net/" -> null
      - primary_queue_host                = "crumblesandboxredissa.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://crumblesandboxredissa.table.core.windows.net/" -> null
      - primary_table_host                = "crumblesandboxredissa.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://crumblesandboxredissa.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "crumblesandboxredissa.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "crumble-recipe-backend-session-storage-cache-sandbox" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
      - secondary_location                = "ukwest" -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"         = "core"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#platops-help"
          - "environment"         = "sandbox"
          - "expiresAfter"        = "2024-06-22"
          - "managedBy"           = "CNP"
          - "startupMode"         = "onDemand"
        } -> null
        # (23 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

Plan: 2 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":995,"Program":"tfcmt","SHA1":"","Target":"sandbox","Vars":{}} -->